# Panda 
- Stands for **Pan**el-**Da**ta.
- Built upon **NumPy**
- Got 2 main structures: 
    * _Series_: One-dimensional array with labeled index
    * _DataFrame_: Matrice with labeled axes (rows and columns)

In [1]:
import warnings
import datetime as dt

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from glob import glob
from pprint import pprint

from matplotlib.lines import Line2D
from matplotlib.legend import Legend
from matplotlib.text import Annotation, Text
from matplotlib.patches import FancyBboxPatch, Patch
from matplotlib.ticker import PercentFormatter, IndexFormatter
from matplotlib.ticker import AutoLocator, MaxNLocator, LinearLocator, MultipleLocator
from matplotlib.ticker import NullFormatter, FixedFormatter, StrMethodFormatter, ScalarFormatter

In [2]:
%matplotlib inline
np.random.seed(42)
warnings.filterwarnings('ignore')

# Series + Df

Serie: is a one dimensional labeled array (one column of information)

Create Series Object from List / Array / Dict

Data are stored in a sequenced order

If an index isn't provided, default numrical values will be assigned

Index are not unique 

Series & DF (in commun): df.index, df.values, df.shape, df.size, df.dtypes

Series object has no attribute info

<span style="color:green"><u>Creating series </u></span> 

`pd.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)`

In [3]:
## 1. From list

pd.Series(data=['chocolate', 'Vanilla', 'Strawberry'])

0     chocolate
1       Vanilla
2    Strawberry
dtype: object

In [4]:
# Convert Serie to a list
pd.Series(data=['chocolate', 'Vanilla', 'Strawberry']).tolist()

['chocolate', 'Vanilla', 'Strawberry']

In [5]:
## 2. From dict

# It turned the keys into the index labels
# <!> Index is not unique

pd.Series(data={"Celia": 1, "Dehia": 2, "Ilyan": 3, "celia": 43})

Celia     1
Dehia     2
Ilyan     3
celia    43
dtype: int64

In [6]:
## 3. Given data and the index

s = pd.Series(data=[6, 2, 3, None], index=["A", "B", "C", "D"])
s

A    6.0
B    2.0
C    3.0
D    NaN
dtype: float64

In [7]:
# Give all of the available attributes and methods within the object
#
dir(s)

['A',
 'B',
 'C',
 'D',
 'T',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_binop',
 '_builtin_table',
 '_can_hold_na',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_convert_dtypes',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_find_valid_index',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_index',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_ix',
 '_ixs',
 '_map_values',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_name',
 '_set_value',
 '_set_with',
 '_set_with_engine',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [8]:
# Displaying data
s.head()
s.tail()

A    6.0
B    2.0
C    3.0
D    NaN
dtype: float64

In [9]:
# <!> size counts none value
pd.Series(s).ndim, pd.Series(s).shape, pd.Series(s).size, len(s)

(1, (4,), 4, 4)

In [10]:
s.sum(), s.product(), s.mean(), max(s), min(s)

(11.0, 36.0, 3.6666666666666665, 6.0, 2.0)

In [11]:
# values -> ndArray
# O: Object
s.values, s.index, s.dtype

(array([ 6.,  2.,  3., nan]),
 Index(['A', 'B', 'C', 'D'], dtype='object'),
 dtype('float64'))

In [12]:
dict(s), list(s)

({'A': 6.0, 'B': 2.0, 'C': 3.0, 'D': nan}, [6.0, 2.0, 3.0, nan])

In [13]:
pd.Series([2, 4]).is_unique, pd.Series([2, 2]).is_unique

(True, False)

<span style="color:green"><u>Sort series </u></span> 

Use __sort_values__ or __sort_index__ instead of sorted

Use __inplace=True__ to overwrite the object

In [14]:
print(f"Sorted by Pyhton: {sorted(s)}\n")

print(f"Sorted by pd with sort_values:\n{s.sort_values(ascending=True, inplace=False)}\n")

print(f"Sorted by pd with sort_index:\n{s.sort_index(ascending=True, inplace=False)}")

Sorted by Pyhton: [2.0, 3.0, 6.0, nan]

Sorted by pd with sort_values:
B    2.0
C    3.0
A    6.0
D    NaN
dtype: float64

Sorted by pd with sort_index:
A    6.0
B    2.0
C    3.0
D    NaN
dtype: float64

<span style="color:green"><u>Sort Dataframe: </u></span> 

```Python
df.sort_values(by="column", ascending=True, na_position="first", inplace=True)

df.sort_values(by=["column1", "column2"], ascending=True, na_position="last", inplace=False)

df.sort_values(by=["column1", "column2"],, ascending=[True, False], na_position="first")

```

<span style="color:green"><u>Creating dataframe: </u></span>

In [15]:
data = np.random.randint(-100, 100, (5, 4))

df = pd.DataFrame(data=data, index=['A', 'B', 'C', 'D', 'E'], columns=['W', 'X', 'Y', 'Z'])
df.name = 'Random data'

In [16]:
# Displaying data
df.head(n=4)
df.tail(n=4)

    W   X   Y   Z
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [17]:
df.sample(n=3, axis=1, random_state=23)

    X   W   Y
A  79   2  -8
B -29   6  88
C  21   2 -26
D  -1  16   3
E  49  30 -48

In [18]:
df.sample(frac=.24, random_state=23)

    W   X   Y   Z
E  30  49 -48 -99

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      int32
 1   X       5 non-null      int32
 2   Y       5 non-null      int32
 3   Z       5 non-null      int32
dtypes: int32(4)
memory usage: 120.0+ bytes

In [20]:
dir(df)

['T',
 'W',
 'X',
 'Y',
 'Z',
 '_AXIS_LEN',
 '_AXIS_NAMES',
 '_AXIS_NUMBERS',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__div__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdiv__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_add_numeric_operations',
 '_add_series_or_dataframe_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_aggregate',
 '_aggregate_multiple_funcs',
 '_align_frame',
 '_align_series',
 '_box_col_values',
 '_builtin_table',
 '_can_fast_transpose',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_cython_table',
 '_data',
 '_deprecations',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_from_arrays',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_cython_func',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_internal_names',
 '_internal_names_set',
 '_is_builtin_func',
 '_is_cached',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iter_column_arrays',
 '_ix',
 '_ixs',
 '_join_compat',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_needs_reindex_multi',
 '_obj_with_exclusions',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_selected_obj',
 '_selection',
 '_selection_list',
 '_selection_name',
 '_series',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_is_copy',
 '_set_item',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_try_aggregate_string_function',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [21]:
df.idxmax(), df.idxmin(), df.mode()

(W    E
 X    A
 Y    B
 Z    D
 dtype: object,
 W    A
 X    B
 Y    E
 Z    E
 dtype: object,
      W   X   Y   Z
 0  2.0 -29 -48 -99
 1  NaN  -1 -26 -86
 2  NaN  21  -8 -80
 3  NaN  49   3 -13
 4  NaN  79  88  51)

<span style="color:green"><u>Index: </u></span>

In [22]:
df.index.get_level_values(0)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [23]:
df.index.set_names(["FF"], inplace=True)

In [24]:
df.index.get_level_values("FF")

Index(['A', 'B', 'C', 'D', 'E'], dtype='object', name='FF')

In [25]:
df.index.name

'FF'

In [26]:
# Reset index
df = df.reset_index()
df.head(n=7)

  FF   W   X   Y   Z
0  A   2  79  -8 -86
1  B   6 -29  88 -80
2  C   2  21 -26 -13
3  D  16  -1   3  51
4  E  30  49 -48 -99

In [27]:
# Replace index
df['F'] = ['AA', 'BB', 'CC', 'DD', 'EE']
df = df.set_index('F', inplace=False)
df

   FF   W   X   Y   Z
F
AA  A   2  79  -8 -86
BB  B   6 -29  88 -80
CC  C   2  21 -26 -13
DD  D  16  -1   3  51
EE  E  30  49 -48 -99

<span style="color:green"><u>Extracting rows: </u></span> 
```
df.loc[['index1', 'index2']]

df.iloc[0] 

df.iloc[0:4]

df.iloc[0, 5]
```

In [28]:
# By index
print(f"{df.index}")
df.loc[['AA', 'BB']]

Index(['AA', 'BB', 'CC', 'DD', 'EE'], dtype='object', name='F')

   FF  W   X   Y   Z
F
AA  A  2  79  -8 -86
BB  B  6 -29  88 -80

In [29]:
# By row
print(f"{df.values}")
df.iloc[0]

[['A' 2 79 -8 -86]
 ['B' 6 -29 88 -80]
 ['C' 2 21 -26 -13]
 ['D' 16 -1 3 51]
 ['E' 30 49 -48 -99]]

FF      A
W       2
X      79
Y      -8
Z     -86
Name: AA, dtype: object

In [30]:
# By row
df.iloc[0: 2]

   FF  W   X   Y   Z
F
AA  A  2  79  -8 -86
BB  B  6 -29  88 -80

In [31]:
# By value
df.iloc[0, 0], df.iloc[0, 1], df.iloc[0, 2], df.iloc[1, 4]

('A', 2, 79, -80)

<span style="color:green"><u>Extracting columns: </u></span> 

```Pyhton
df[['column1', 'column2']]
```

In [32]:
df[['W', 'X']]

     W   X
F
AA   2  79
BB   6 -29
CC   2  21
DD  16  -1
EE  30  49

<span style="color:green"><u>Extracting rows and columns: </u></span> 
```Pyhton
df.loc[['indx1', 'index2']], ['column1]]
```

In [33]:
df.loc[["AA", "BB"], ['W']]

    W
F
AA  2
BB  6

<span style="color:green"><u>Iterating on rows DataFrame: </u></span>

In [34]:
for index, row in df.iterrows():
    print(f"Index: {index}\n"+
          f"Row:\n{row}\n" +
          f"------------\n")

Index: AA
Row:
FF      A
W       2
X      79
Y      -8
Z     -86
Name: AA, dtype: object
------------

Index: BB
Row:
FF      B
W       6
X     -29
Y      88
Z     -80
Name: BB, dtype: object
------------

Index: CC
Row:
FF      C
W       2
X      21
Y     -26
Z     -13
Name: CC, dtype: object
------------

Index: DD
Row:
FF     D
W     16
X     -1
Y      3
Z     51
Name: DD, dtype: object
------------

Index: EE
Row:
FF      E
W      30
X      49
Y     -48
Z     -99
Name: EE, dtype: object
------------

In [35]:
for index, row in df.iterrows():
    print(f"{row['W']:>5} | {row['X']:>2}")
    break

    2 | 79

<span style="color:green"><u>Filters: </u></span>

In [36]:
df[(df['W'] > 0) & (df['Y'] > 1)]
df[(df['W'] > 0) | (df['Y'] > 1)]
df[df['W'].between(10, 39)]

   FF   W   X   Y   Z
F
DD  D  16  -1   3  51
EE  E  30  49 -48 -99

In [37]:
df.nlargest(2, columns="W")

   FF   W   X   Y   Z
F
EE  E  30  49 -48 -99
DD  D  16  -1   3  51

In [38]:
df.nsmallest(2, columns="W")

   FF  W   X   Y   Z
F
AA  A  2  79  -8 -86
CC  C  2  21 -26 -13

In [39]:
# Return all the dataframe, row that are not concerned is in NaN
mask = df == 2
df.where(mask)

     FF    W   X   Y   Z
F
AA  NaN  2.0 NaN NaN NaN
BB  NaN  NaN NaN NaN NaN
CC  NaN  2.0 NaN NaN NaN
DD  NaN  NaN NaN NaN NaN
EE  NaN  NaN NaN NaN NaN

In [40]:
df.isin([3, 16])

       FF      W      X      Y      Z
F
AA  False  False  False  False  False
BB  False  False  False  False  False
CC  False  False  False  False  False
DD  False   True  False   True  False
EE  False  False  False  False  False

In [41]:
df.isin({'W': [3, 16]})

       FF      W      X      Y      Z
F
AA  False  False  False  False  False
BB  False  False  False  False  False
CC  False  False  False  False  False
DD  False   True  False  False  False
EE  False  False  False  False  False

In [42]:
df

   FF   W   X   Y   Z
F
AA  A   2  79  -8 -86
BB  B   6 -29  88 -80
CC  C   2  21 -26 -13
DD  D  16  -1   3  51
EE  E  30  49 -48 -99

<span style="color:green"><u>Query: </u></span>

In [43]:
df.query("X == 21")

   FF  W   X   Y   Z
F
CC  C  2  21 -26 -13

In [44]:
df.query("X in ['Sean Connery', 'George Lazenby']")

Empty DataFrame
Columns: [FF, W, X, Y, Z]
Index: []

In [45]:
df.query("X > 3")

   FF   W   X   Y   Z
F
AA  A   2  79  -8 -86
CC  C   2  21 -26 -13
EE  E  30  49 -48 -99

<span style="color:green"><u>Stats: </u></span>

In [46]:
df

   FF   W   X   Y   Z
F
AA  A   2  79  -8 -86
BB  B   6 -29  88 -80
CC  C   2  21 -26 -13
DD  D  16  -1   3  51
EE  E  30  49 -48 -99

In [47]:
# The mode that represents the value that occurs the most frequently
df.mode()

  FF    W   X   Y   Z
0  A  2.0 -29 -48 -99
1  B  NaN  -1 -26 -86
2  C  NaN  21  -8 -80
3  D  NaN  49   3 -13
4  E  NaN  79  88  51

In [48]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, AA to EE
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FF      5 non-null      object
 1   W       5 non-null      int32
 2   X       5 non-null      int32
 3   Y       5 non-null      int32
 4   Z       5 non-null      int32
dtypes: int32(4), object(1)
memory usage: 320.0+ bytes

<span style="color:green"><u>Dropna: </u></span>

**dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)**

*axis=1* $\to$ column

*axis=0* $\to$ row

*inplace=True*, instead of re-assigning the DF

*how='all'*, if all values are NA, drop that row or columnn

*how='any* if any NA values are present, drop that row or columnn

In [50]:
df = pd.DataFrame({'A': [1, 5, np.nan, 5, 5],
                   'B': [1, np.nan, np.nan, 5, 5],
                   'C': [1, np.nan, np.nan, 5, 5]})
df

     A    B    C
0  1.0  1.0  1.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN
3  5.0  5.0  5.0
4  5.0  5.0  5.0

In [51]:
df['A'].drop_duplicates(keep=False)

0    1.0
2    NaN
Name: A, dtype: float64

In [52]:
df.drop_duplicates(subset=["A"], keep=False)

     A    B    C
0  1.0  1.0  1.0
2  NaN  NaN  NaN

In [53]:
df.drop_duplicates()

     A    B    C
0  1.0  1.0  1.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN
3  5.0  5.0  5.0

In [54]:
df['A'].duplicated(keep="last")
df['A'].duplicated(keep="first")
df['A'].duplicated(keep=False)

0    False
1     True
2    False
3     True
4     True
Name: A, dtype: bool

In [55]:
mask = ~df['A'].duplicated(keep="first")
df[mask]

     A    B    C
0  1.0  1.0  1.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN

In [56]:
# thresh: More than 2 Nan values to delete a row / column
print(f"Missing values on columns:\n{df.dropna(axis=1, thresh=2)}\n")

print(f"Missing values on rows:\n{df.dropna(axis=0)}\n")
 
print(f"Drop missing values on subset:\n{df.dropna(subset=['A', 'C'])}")

Missing values on columns:
     A    B    C
0  1.0  1.0  1.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN
3  5.0  5.0  5.0
4  5.0  5.0  5.0

Missing values on rows:
     A    B    C
0  1.0  1.0  1.0
3  5.0  5.0  5.0
4  5.0  5.0  5.0

Drop missing values on subset:
     A    B    C
0  1.0  1.0  1.0
3  5.0  5.0  5.0
4  5.0  5.0  5.0

<span style="color:green"><u>Fillna: </u></span>

1. Delete 
1. Mean
1. Mediane
1. Mode (most frequent value)
1. Based on another column 

**DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)** : 

Fill NaN values in specific columns by {backfill, bfill, pad, ffil, None, value}

- **pad / ffill**: propagate last valid observation forward to next valid 
- **backfill / bfill**: use next valid observation to fill gap


Pandas is built on top of numpy, which has neither na nor null values. Instead numpy has NaN (Not a Number) values. 

The 2 functions isna() and isnull() do exactly the same job, they are from R dataframe.

In [57]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True   True
2   True   True   True
3  False  False  False
4  False  False  False

In [58]:
df.isna()

       A      B      C
0  False  False  False
1  False   True   True
2   True   True   True
3  False  False  False
4  False  False  False

In [59]:
df.isnull().sum(axis=0)

A    1
B    2
C    2
dtype: int64

In [60]:
df.isnull().sum(axis=1)

0    0
1    2
2    3
3    0
4    0
dtype: int64

In [61]:
df.notnull()

       A      B      C
0   True   True   True
1   True  False  False
2  False  False  False
3   True   True   True
4   True   True   True

In [62]:
df

     A    B    C
0  1.0  1.0  1.0
1  5.0  NaN  NaN
2  NaN  NaN  NaN
3  5.0  5.0  5.0
4  5.0  5.0  5.0

In [63]:
df.fillna(value=0)

     A    B    C
0  1.0  1.0  1.0
1  5.0  0.0  0.0
2  0.0  0.0  0.0
3  5.0  5.0  5.0
4  5.0  5.0  5.0

In [64]:
df.fillna(value='X')

   A  B  C
0  1  1  1
1  5  X  X
2  X  X  X
3  5  5  5
4  5  5  5

In [65]:
df.fillna(value=df.mean())

     A         B         C
0  1.0  1.000000  1.000000
1  5.0  3.666667  3.666667
2  4.0  3.666667  3.666667
3  5.0  5.000000  5.000000
4  5.0  5.000000  5.000000

In [66]:
df['A'].fillna(value='X')

0    1
1    5
2    X
3    5
4    5
Name: A, dtype: object

In [67]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    5.0
2    4.0
3    5.0
4    5.0
Name: A, dtype: float64

<span style="color:green"><u>Read file: </u></span>

In [68]:
# Import Series / DF with the read_csv 
file_name = glob("./data/Universities.csv")[0]

df = pd.read_csv(filepath_or_buffer=file_name, sep=',')
df.head(3)

,Sector,University,Year,Completions,Geography
0,"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,591,Nevada
1,"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,28,Nevada
2,"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2016,408,Nevada

<span style="color:green"><u>Insert new column: </u></span>

In [69]:
# Rename column
print(f"After{df.columns}\n")
df.rename(columns={"Geography": "GEography"}, inplace=True)
print(f"After{df.columns}")

AfterIndex(['Sector', 'University', 'Year', 'Completions', 'Geography'], dtype='object')

AfterIndex(['Sector', 'University', 'Year', 'Completions', 'GEography'], dtype='object')

In [70]:
# Rename Index 
print(f"After{df.index}\n")
df.rename(index={1: "Index_1"}, inplace=True)
print(f"After{df.index}")

AfterRangeIndex(start=0, stop=207, step=1)

AfterIndex([        0, 'Index_1',         2,         3,         4,         5,
               6,         7,         8,         9,
       ...
             197,       198,       199,       200,       201,       202,
             203,       204,       205,       206],
      dtype='object', length=207)

In [71]:
df.axes

[Index([        0, 'Index_1',         2,         3,         4,         5,
                6,         7,         8,         9,
        ...
              197,       198,       199,       200,       201,       202,
              203,       204,       205,       206],
       dtype='object', length=207),
 Index(['Sector', 'University', 'Year', 'Completions', 'GEography'], dtype='object')]

In [72]:
df.shape, df.size, 207 * 5

((207, 5), 1035, 1035)

In [73]:
# loc: Number of the column, starting from 0
df.insert(loc=3, column = "Sport", value = "Volley")
df.columns

Index(['Sector', 'University', 'Year', 'Sport', 'Completions', 'GEography'], dtype='object')

<span style="color:green"><u>Remove columns: </u></span>

In [74]:
# Remove and pop

print(f"Before:\n{df.columns}\n")
geography = df.pop("GEography")
print(f"Before:\n{df.columns}")

Before:
Index(['Sector', 'University', 'Year', 'Sport', 'Completions', 'GEography'], dtype='object')

Before:
Index(['Sector', 'University', 'Year', 'Sport', 'Completions'], dtype='object')

In [75]:
df2 = pd.read_csv(filepath_or_buffer='data/pokemon.csv', 
                  sep=',', usecols=["Pokemon"], # Specify the column
                  squeeze=True)         # Convert to Series (ndarray)
                    
df2.head(3)

0    Bulbasaur
1      Ivysaur
2     Venusaur
Name: Pokemon, dtype: object

In [76]:
df_index = pd.read_csv(filepath_or_buffer="data/pokemon.csv", 
                       index_col="Pokemon", # The given column becomes an index
                       squeeze=True)         # Convert to Series (ndarray)

df_index.head(n=3)

Pokemon
Bulbasaur    Grass
Ivysaur      Grass
Venusaur     Grass
Name: Type, dtype: object

In [77]:
df_index[0], df_index["Bulbasaur"] # Same

('Grass', 'Grass')

In [78]:
(df_index.get(key="Bulbasaur"), df_index.get(key=["Bulbasaur", "Ivysaur", 2], default=None))

('Grass', None)

In [79]:
df2.map(df_index).head(n=3)

0    Grass
1    Grass
2    Grass
Name: Pokemon, dtype: object

In [80]:
df_dict = pd.read_csv(filepath_or_buffer="data/pokemon.csv", 
                       index_col="Pokemon", squeeze=True).to_dict()
df_dict

{'Bulbasaur': 'Grass',
 'Ivysaur': 'Grass',
 'Venusaur': 'Grass',
 'Charmander': 'Fire',
 'Charmeleon': 'Fire',
 'Charizard': 'Fire',
 'Squirtle': 'Water',
 'Wartortle': 'Water',
 'Blastoise': 'Water',
 'Caterpie': 'Bug',
 'Metapod': 'Bug',
 'Butterfree': 'Bug',
 'Weedle': 'Bug',
 'Kakuna': 'Bug',
 'Beedrill': 'Bug',
 'Pidgey': 'Normal',
 'Pidgeotto': 'Normal',
 'Pidgeot': 'Normal',
 'Rattata': 'Normal',
 'Raticate': 'Normal',
 'Spearow': 'Normal',
 'Fearow': 'Normal',
 'Ekans': 'Poison',
 'Arbok': 'Poison',
 'Pikachu': 'Electric',
 'Raichu': 'Electric',
 'Sandshrew': 'Ground',
 'Sandslash': 'Ground',
 'Nidoran': 'Poison',
 'Nidorina': 'Poison',
 'Nidoqueen': 'Poison',
 'Nidoran♂': 'Poison',
 'Nidorino': 'Poison',
 'Nidoking': 'Poison',
 'Clefairy': 'Fairy',
 'Clefable': 'Fairy',
 'Vulpix': 'Fire',
 'Ninetales': 'Fire',
 'Jigglypuff': 'Normal',
 'Wigglytuff': 'Normal',
 'Zubat': 'Poison',
 'Golbat': 'Poison',
 'Oddish': 'Grass',
 'Gloom': 'Grass',
 'Vileplume': 'Grass',
 'Paras': 'Bug',
 'Parasect': 'Bug',
 'Venonat': 'Bug',
 'Venomoth': 'Bug',
 'Diglett': 'Ground',
 'Dugtrio': 'Ground',
 'Meowth': 'Normal',
 'Persian': 'Normal',
 'Psyduck': 'Water',
 'Golduck': 'Water',
 'Mankey': 'Fighting',
 'Primeape': 'Fighting',
 'Growlithe': 'Fire',
 'Arcanine': 'Fire',
 'Poliwag': 'Water',
 'Poliwhirl': 'Water',
 'Poliwrath': 'Water',
 'Abra': 'Psychic',
 'Kadabra': 'Psychic',
 'Alakazam': 'Psychic',
 'Machop': 'Fighting',
 'Machoke': 'Fighting',
 'Machamp': 'Fighting',
 'Bellsprout': 'Grass',
 'Weepinbell': 'Grass',
 'Victreebel': 'Grass',
 'Tentacool': 'Water',
 'Tentacruel': 'Water',
 'Geodude': 'Rock',
 'Graveler': 'Rock',
 'Golem': 'Rock',
 'Ponyta': 'Fire',
 'Rapidash': 'Fire',
 'Slowpoke': 'Water',
 'Slowbro': 'Water',
 'Magnemite': 'Electric',
 'Magneton': 'Electric',
 "Farfetch'd": 'Normal',
 'Doduo': 'Normal',
 'Dodrio': 'Normal',
 'Seel': 'Water',
 'Dewgong': 'Water',
 'Grimer': 'Poison',
 'Muk': 'Poison',
 'Shellder': 'Water',
 'Cloyster': 'Water',
 'Gastly': 'Ghost',
 'Haunter': 'Ghost',
 'Gengar': 'Ghost',
 'Onix': 'Rock',
 'Drowzee': 'Psychic',
 'Hypno': 'Psychic',
 'Krabby': 'Water',
 'Kingler': 'Water',
 'Voltorb': 'Electric',
 'Electrode': 'Electric',
 'Exeggcute': 'Grass',
 'Exeggutor': 'Grass',
 'Cubone': 'Ground',
 'Marowak': 'Ground',
 'Hitmonlee': 'Fighting',
 'Hitmonchan': 'Fighting',
 'Lickitung': 'Normal',
 'Koffing': 'Poison',
 'Weezing': 'Poison',
 'Rhyhorn': 'Ground',
 'Rhydon': 'Ground',
 'Chansey': 'Normal',
 'Tangela': 'Grass',
 'Kangaskhan': 'Normal',
 'Horsea': 'Water',
 'Seadra': 'Water',
 'Goldeen': 'Water',
 'Seaking': 'Water',
 'Staryu': 'Water',
 'Starmie': 'Water',
 'Mr. Mime': 'Psychic',
 'Scyther': 'Bug',
 'Jynx': 'Ice',
 'Electabuzz': 'Electric',
 'Magmar': 'Fire',
 'Pinsir': 'Bug',
 'Tauros': 'Normal',
 'Magikarp': 'Water',
 'Gyarados': 'Water',
 'Lapras': 'Water',
 'Ditto': 'Normal',
 'Eevee': 'Normal',
 'Vaporeon': 'Water',
 'Jolteon': 'Electric',
 'Flareon': 'Fire',
 'Porygon': 'Normal',
 'Omanyte': 'Rock',
 'Omastar': 'Rock',
 'Kabuto': 'Rock',
 'Kabutops': 'Rock',
 'Aerodactyl': 'Rock',
 'Snorlax': 'Normal',
 'Articuno': 'Ice',
 'Zapdos': 'Electric',
 'Moltres': 'Fire',
 'Dratini': 'Dragon',
 'Dragonair': 'Dragon',
 'Dragonite': 'Dragon',
 'Mewtwo': 'Psychic',
 'Mew': 'Psychic',
 'Chikorita': 'Grass',
 'Bayleef': 'Grass',
 'Meganium': 'Grass',
 'Cyndaquil': 'Fire',
 'Quilava': 'Fire',
 'Typhlosion': 'Fire',
 'Totodile': 'Water',
 'Croconaw': 'Water',
 'Feraligatr': 'Water',
 'Sentret': 'Normal',
 'Furret': 'Normal',
 'Hoothoot': 'Normal',
 'Noctowl': 'Normal',
 'Ledyba': 'Bug',
 'Ledian': 'Bug',
 'Spinarak': 'Bug',
 'Ariados': 'Bug',
 'Crobat': 'Poison',
 'Chinchou': 'Water',
 'Lanturn': 'Water',
 'Pichu': 'Electric',
 'Cleffa': 'Fairy',
 'Igglybuff': 'Normal',
 'Togepi': 'Fairy',
 'Togetic': 'Fairy',
 'Natu': 'Psychic',
 'Xatu': 'Psychic',
 'Mareep': 'Electric',
 'Flaaffy': 'Electric',
 'Ampharos': 'Electric',
 'Bellossom': 'Grass',
 'Marill': 'Water',
 'Azumarill': 'Water',
 'Sudowoodo': 'Rock',
 'Politoed': 'Water',
 'Hoppip': 'Grass',
 'Skiploom': 'Grass',
 'Jumpluff': 'Grass',
 'Aipom': 'Normal',
 'Sunkern': 'Grass',
 'Sunflora': 'Grass',
 'Yanma': 'Bug',
 'Wooper': 'Water',
 'Quagsire': 'Water',
 'Espeon': 'Psychic',
 'Umbreon': 'Dark',
 'Murkrow': 'Dark',
 'Slowking': 'Water',
 'Misdreavus': 'Ghost',
 'Unown': 'Psychic',
 'Wobbuffet': 'Psychic',
 'Girafarig': 'Normal',
 'Pineco': 'Bug',
 'Forretress': 'Bug',
 'Dunsparce': 'Normal',
 'Gligar': 'Ground',
 'Steelix': 'Steel',
 'Snubbull': 'Fairy',
 'Granbull': 'Fairy',
 'Qwilfish': 'Water',
 'Scizor': 'Bug',
 'Shuckle': 'Bug',
 'Heracross': 'Bug',
 'Sneasel': 'Dark',
 'Teddiursa': 'Normal',
 'Ursaring': 'Normal',
 'Slugma': 'Fire',
 'Magcargo': 'Fire',
 'Swinub': 'Ice',
 'Piloswine': 'Ice',
 'Corsola': 'Water',
 'Remoraid': 'Water',
 'Octillery': 'Water',
 'Delibird': 'Ice',
 'Mantine': 'Water',
 'Skarmory': 'Steel',
 'Houndour': 'Dark',
 'Houndoom': 'Dark',
 'Kingdra': 'Water',
 'Phanpy': 'Ground',
 'Donphan': 'Ground',
 'Porygon2': 'Normal',
 'Stantler': 'Normal',
 'Smeargle': 'Normal',
 'Tyrogue': 'Fighting',
 'Hitmontop': 'Fighting',
 'Smoochum': 'Ice',
 'Elekid': 'Electric',
 'Magby': 'Fire',
 'Miltank': 'Normal',
 'Blissey': 'Normal',
 'Raikou': 'Electric',
 'Entei': 'Fire',
 'Suicune': 'Water',
 'Larvitar': 'Rock',
 'Pupitar': 'Rock',
 'Tyranitar': 'Rock',
 'Lugia': 'Psychic',
 'Ho-oh': 'Fire',
 'Celebi': 'Psychic',
 'Treecko': 'Grass',
 'Grovyle': 'Grass',
 'Sceptile': 'Grass',
 'Torchic': 'Fire',
 'Combusken': 'Fire',
 'Blaziken': 'Fire',
 'Mudkip': 'Water',
 'Marshtomp': 'Water',
 'Swampert': 'Water',
 'Poochyena': 'Dark',
 'Mightyena': 'Dark',
 'Zigzagoon': 'Normal',
 'Linoone': 'Normal',
 'Wurmple': 'Bug',
 'Silcoon': 'Bug',
 'Beautifly': 'Bug',
 'Cascoon': 'Bug',
 'Dustox': 'Bug',
 'Lotad': 'Water',
 'Lombre': 'Water',
 'Ludicolo': 'Water',
 'Seedot': 'Grass',
 'Nuzleaf': 'Grass',
 'Shiftry': 'Grass',
 'Taillow': 'Normal',
 'Swellow': 'Normal',
 'Wingull': 'Water',
 'Pelipper': 'Water',
 'Ralts': 'Psychic',
 'Kirlia': 'Psychic',
 'Gardevoir': 'Psychic',
 'Surskit': 'Bug',
 'Masquerain': 'Bug',
 'Shroomish': 'Grass',
 'Breloom': 'Grass',
 'Slakoth': 'Normal',
 'Vigoroth': 'Normal',
 'Slaking': 'Normal',
 'Nincada': 'Bug',
 'Ninjask': 'Bug',
 'Shedinja': 'Bug',
 'Whismur': 'Normal',
 'Loudred': 'Normal',
 'Exploud': 'Normal',
 'Makuhita': 'Fighting',
 'Hariyama': 'Fighting',
 'Azurill': 'Normal',
 'Nosepass': 'Rock',
 'Skitty': 'Normal',
 'Delcatty': 'Normal',
 'Sableye': 'Dark',
 'Mawile': 'Steel',
 'Aron': 'Steel',
 'Lairon': 'Steel',
 'Aggron': 'Steel',
 'Meditite': 'Fighting',
 'Medicham': 'Fighting',
 'Electrike': 'Electric',
 'Manectric': 'Electric',
 'Plusle': 'Electric',
 'Minun': 'Electric',
 'Volbeat': 'Bug',
 'Illumise': 'Bug',
 'Roselia': 'Grass',
 'Gulpin': 'Poison',
 'Swalot': 'Poison',
 'Carvanha': 'Water',
 'Sharpedo': 'Water',
 'Wailmer': 'Water',
 'Wailord': 'Water',
 'Numel': 'Fire',
 'Camerupt': 'Fire',
 'Torkoal': 'Fire',
 'Spoink': 'Psychic',
 'Grumpig': 'Psychic',
 'Spinda': 'Normal',
 'Trapinch': 'Ground',
 'Vibrava': 'Ground',
 'Flygon': 'Ground',
 'Cacnea': 'Grass',
 'Cacturne': 'Grass',
 'Swablu': 'Normal',
 'Altaria': 'Dragon',
 'Zangoose': 'Normal',
 'Seviper': 'Poison',
 'Lunatone': 'Rock',
 'Solrock': 'Rock',
 'Barboach': 'Water',
 'Whiscash': 'Water',
 'Corphish': 'Water',
 'Crawdaunt': 'Water',
 'Baltoy': 'Ground',
 'Claydol': 'Ground',
 'Lileep': 'Rock',
 'Cradily': 'Rock',
 'Anorith': 'Rock',
 'Armaldo': 'Rock',
 'Feebas': 'Water',
 'Milotic': 'Water',
 'Castform': 'Normal',
 'Kecleon': 'Normal',
 'Shuppet': 'Ghost',
 'Banette': 'Ghost',
 'Duskull': 'Ghost',
 'Dusclops': 'Ghost',
 'Tropius': 'Grass',
 'Chimecho': 'Psychic',
 'Absol': 'Dark',
 'Wynaut': 'Psychic',
 'Snorunt': 'Ice',
 'Glalie': 'Ice',
 'Spheal': 'Ice',
 'Sealeo': 'Ice',
 'Walrein': 'Ice',
 'Clamperl': 'Water',
 'Huntail': 'Water',
 'Gorebyss': 'Water',
 'Relicanth': 'Water',
 'Luvdisc': 'Water',
 'Bagon': 'Dragon',
 'Shelgon': 'Dragon',
 'Salamence': 'Dragon',
 'Beldum': 'Steel',
 'Metang': 'Steel',
 'Metagross': 'Steel',
 'Regirock': 'Rock',
 'Regice': 'Ice',
 'Registeel': 'Steel',
 'Latias': 'Dragon',
 'Latios': 'Dragon',
 'Kyogre': 'Water',
 'Groudon': 'Ground',
 'Rayquaza': 'Dragon',
 'Jirachi': 'Steel',
 'Deoxys': 'Psychic',
 'Turtwig': 'Grass',
 'Grotle': 'Grass',
 'Torterra': 'Grass',
 'Chimchar': 'Fire',
 'Monferno': 'Fire',
 'Infernape': 'Fire',
 'Piplup': 'Water',
 'Prinplup': 'Water',
 'Empoleon': 'Water',
 'Starly': 'Normal',
 'Staravia': 'Normal',
 'Staraptor': 'Normal',
 'Bidoof': 'Normal',
 'Bibarel': 'Normal',
 'Kricketot': 'Bug',
 'Kricketune': 'Bug',
 'Shinx': 'Electric',
 'Luxio': 'Electric',
 'Luxray': 'Electric',
 'Budew': 'Grass',
 'Roserade': 'Grass',
 'Cranidos': 'Rock',
 'Rampardos': 'Rock',
 'Shieldon': 'Rock',
 'Bastiodon': 'Rock',
 'Burmy': 'Bug',
 'Wormadam': 'Bug',
 'Mothim': 'Bug',
 'Combee': 'Bug',
 'Vespiquen': 'Bug',
 'Pachirisu': 'Electric',
 'Buizel': 'Water',
 'Floatzel': 'Water',
 'Cherubi': 'Grass',
 'Cherrim': 'Grass',
 'Shellos': 'Water',
 'Gastrodon': 'Water',
 'Ambipom': 'Normal',
 'Drifloon': 'Ghost',
 'Drifblim': 'Ghost',
 'Buneary': 'Normal',
 'Lopunny': 'Normal',
 'Mismagius': 'Ghost',
 'Honchkrow': 'Dark',
 'Glameow': 'Normal',
 'Purugly': 'Normal',
 'Chingling': 'Psychic',
 'Stunky': 'Poison',
 'Skuntank': 'Poison',
 'Bronzor': 'Steel',
 'Bronzong': 'Steel',
 'Bonsly': 'Rock',
 'Mime Jr.': 'Psychic',
 'Happiny': 'Normal',
 'Chatot': 'Normal',
 'Spiritomb': 'Ghost',
 'Gible': 'Dragon',
 'Gabite': 'Dragon',
 'Garchomp': 'Dragon',
 'Munchlax': 'Normal',
 'Riolu': 'Fighting',
 'Lucario': 'Fighting',
 'Hippopotas': 'Ground',
 'Hippowdon': 'Ground',
 'Skorupi': 'Poison',
 'Drapion': 'Poison',
 'Croagunk': 'Poison',
 'Toxicroak': 'Poison',
 'Carnivine': 'Grass',
 'Finneon': 'Water',
 'Lumineon': 'Water',
 'Mantyke': 'Water',
 'Snover': 'Grass',
 'Abomasnow': 'Grass',
 'Weavile': 'Dark',
 'Magnezone': 'Electric',
 'Lickilicky': 'Normal',
 'Rhyperior': 'Ground',
 'Tangrowth': 'Grass',
 'Electivire': 'Electric',
 'Magmortar': 'Fire',
 'Togekiss': 'Fairy',
 'Yanmega': 'Bug',
 'Leafeon': 'Grass',
 'Glaceon': 'Ice',
 'Gliscor': 'Ground',
 'Mamoswine': 'Ice',
 'Porygon-Z': 'Normal',
 'Gallade': 'Psychic',
 'Probopass': 'Rock',
 'Dusknoir': 'Ghost',
 'Froslass': 'Ice',
 'Rotom': 'Electric',
 'Uxie': 'Psychic',
 'Mesprit': 'Psychic',
 'Azelf': 'Psychic',
 'Dialga': 'Steel',
 'Palkia': 'Water',
 'Heatran': 'Fire',
 'Regigigas': 'Normal',
 'Giratina': 'Ghost',
 'Cresselia': 'Psychic',
 'Phione': 'Water',
 'Manaphy': 'Water',
 'Darkrai': 'Dark',
 'Shaymin': 'Grass',
 'Arceus': 'Normal',
 'Victini': 'Psychic',
 'Snivy': 'Grass',
 'Servine': 'Grass',
 'Serperior': 'Grass',
 'Tepig': 'Fire',
 'Pignite': 'Fire',
 'Emboar': 'Fire',
 'Oshawott': 'Water',
 'Dewott': 'Water',
 'Samurott': 'Water',
 'Patrat': 'Normal',
 'Watchog': 'Normal',
 'Lillipup': 'Normal',
 'Herdier': 'Normal',
 'Stoutland': 'Normal',
 'Purrloin': 'Dark',
 'Liepard': 'Dark',
 'Pansage': 'Grass',
 'Simisage': 'Grass',
 'Pansear': 'Fire',
 'Simisear': 'Fire',
 'Panpour': 'Water',
 'Simipour': 'Water',
 'Munna': 'Psychic',
 'Musharna': 'Psychic',
 'Pidove': 'Normal',
 'Tranquill': 'Normal',
 'Unfezant': 'Normal',
 'Blitzle': 'Electric',
 'Zebstrika': 'Electric',
 'Roggenrola': 'Rock',
 'Boldore': 'Rock',
 'Gigalith': 'Rock',
 'Woobat': 'Psychic',
 'Swoobat': 'Psychic',
 'Drilbur': 'Ground',
 'Excadrill': 'Ground',
 'Audino': 'Normal',
 'Timburr': 'Fighting',
 'Gurdurr': 'Fighting',
 'Conkeldurr': 'Fighting',
 'Tympole': 'Water',
 'Palpitoad': 'Water',
 'Seismitoad': 'Water',
 'Throh': 'Fighting',
 'Sawk': 'Fighting',
 'Sewaddle': 'Bug',
 'Swadloon': 'Bug',
 'Leavanny': 'Bug',
 'Venipede': 'Bug',
 'Whirlipede': 'Bug',
 'Scolipede': 'Bug',
 'Cottonee': 'Grass',
 'Whimsicott': 'Grass',
 'Petilil': 'Grass',
 'Lilligant': 'Grass',
 'Basculin': 'Water',
 'Sandile': 'Ground',
 'Krokorok': 'Ground',
 'Krookodile': 'Ground',
 'Darumaka': 'Fire',
 'Darmanitan': 'Fire',
 'Maractus': 'Grass',
 'Dwebble': 'Bug',
 'Crustle': 'Bug',
 'Scraggy': 'Dark',
 'Scrafty': 'Dark',
 'Sigilyph': 'Psychic',
 'Yamask': 'Ghost',
 'Cofagrigus': 'Ghost',
 'Tirtouga': 'Water',
 'Carracosta': 'Water',
 'Archen': 'Rock',
 'Archeops': 'Rock',
 'Trubbish': 'Poison',
 'Garbodor': 'Poison',
 'Zorua': 'Dark',
 'Zoroark': 'Dark',
 'Minccino': 'Normal',
 'Cinccino': 'Normal',
 'Gothita': 'Psychic',
 'Gothorita': 'Psychic',
 'Gothitelle': 'Psychic',
 'Solosis': 'Psychic',
 'Duosion': 'Psychic',
 'Reuniclus': 'Psychic',
 'Ducklett': 'Water',
 'Swanna': 'Water',
 'Vanillite': 'Ice',
 'Vanillish': 'Ice',
 'Vanilluxe': 'Ice',
 'Deerling': 'Normal',
 'Sawsbuck': 'Normal',
 'Emolga': 'Electric',
 'Karrablast': 'Bug',
 'Escavalier': 'Bug',
 'Foongus': 'Grass',
 'Amoonguss': 'Grass',
 'Frillish': 'Water',
 'Jellicent': 'Water',
 'Alomomola': 'Water',
 'Joltik': 'Bug',
 'Galvantula': 'Bug',
 'Ferroseed': 'Grass',
 'Ferrothorn': 'Grass',
 'Klink': 'Steel',
 'Klang': 'Steel',
 'Klinklang': 'Steel',
 'Tynamo': 'Electric',
 'Eelektrik': 'Electric',
 'Eelektross': 'Electric',
 'Elgyem': 'Psychic',
 'Beheeyem': 'Psychic',
 'Litwick': 'Ghost',
 'Lampent': 'Ghost',
 'Chandelure': 'Ghost',
 'Axew': 'Dragon',
 'Fraxure': 'Dragon',
 'Haxorus': 'Dragon',
 'Cubchoo': 'Ice',
 'Beartic': 'Ice',
 'Cryogonal': 'Ice',
 'Shelmet': 'Bug',
 'Accelgor': 'Bug',
 'Stunfisk': 'Ground',
 'Mienfoo': 'Fighting',
 'Mienshao': 'Fighting',
 'Druddigon': 'Dragon',
 'Golett': 'Ground',
 'Golurk': 'Ground',
 'Pawniard': 'Dark',
 'Bisharp': 'Dark',
 'Bouffalant': 'Normal',
 'Rufflet': 'Normal',
 'Braviary': 'Normal',
 'Vullaby': 'Dark',
 'Mandibuzz': 'Dark',
 'Heatmor': 'Fire',
 'Durant': 'Bug',
 'Deino': 'Dark',
 'Zweilous': 'Dark',
 'Hydreigon': 'Dark',
 'Larvesta': 'Bug',
 'Volcarona': 'Bug',
 'Cobalion': 'Steel',
 'Terrakion': 'Rock',
 'Virizion': 'Grass',
 'Tornadus': 'Flying',
 'Thundurus': 'Electric',
 'Reshiram': 'Dragon',
 'Zekrom': 'Dragon',
 'Landorus': 'Ground',
 'Kyurem': 'Dragon',
 'Keldeo': 'Water',
 'Meloetta': 'Normal',
 'Genesect': 'Bug',
 'Chespin': 'Grass',
 'Quilladin': 'Grass',
 'Chesnaught': 'Grass',
 'Fennekin': 'Fire',
 'Braixen': 'Fire',
 'Delphox': 'Fire',
 'Froakie': 'Water',
 'Frogadier': 'Water',
 'Greninja': 'Water',
 'Bunnelby': 'Normal',
 'Diggersby': 'Normal',
 'Fletchling': 'Normal',
 'Fletchinder': 'Fire',
 'Talonflame': 'Fire',
 'Scatterbug': 'Bug',
 'Spewpa': 'Bug',
 'Vivillon': 'Bug',
 'Litleo': 'Fire',
 'Pyroar': 'Fire',
 'Flabébé': 'Fairy',
 'Floette': 'Fairy',
 'Florges': 'Fairy',
 'Skiddo': 'Grass',
 'Gogoat': 'Grass',
 'Pancham': 'Fighting',
 'Pangoro': 'Fighting',
 'Furfrou': 'Normal',
 'Espurr': 'Psychic',
 'Meowstic': 'Psychic',
 'Honedge': 'Steel',
 'Doublade': 'Steel',
 'Aegislash': 'Steel',
 'Spritzee': 'Fairy',
 'Aromatisse': 'Fairy',
 'Swirlix': 'Fairy',
 'Slurpuff': 'Fairy',
 'Inkay': 'Dark',
 'Malamar': 'Dark',
 'Binacle': 'Rock',
 'Barbaracle': 'Rock',
 'Skrelp': 'Poison',
 'Dragalge': 'Poison',
 'Clauncher': 'Water',
 'Clawitzer': 'Water',
 'Helioptile': 'Electric',
 'Heliolisk': 'Electric',
 'Tyrunt': 'Rock',
 'Tyrantrum': 'Rock',
 'Amaura': 'Rock',
 'Aurorus': 'Rock',
 'Sylveon': 'Fairy',
 'Hawlucha': 'Fighting',
 'Dedenne': 'Electric',
 'Carbink': 'Rock',
 'Goomy': 'Dragon',
 'Sliggoo': 'Dragon',
 'Goodra': 'Dragon',
 'Klefki': 'Steel',
 'Phantump': 'Ghost',
 'Trevenant': 'Ghost',
 'Pumpkaboo': 'Ghost',
 'Gourgeist': 'Ghost',
 'Bergmite': 'Ice',
 'Avalugg': 'Ice',
 'Noibat': 'Flying',
 'Noivern': 'Flying',
 'Xerneas': 'Fairy',
 'Yveltal': 'Dark',
 'Zygarde': 'Dragon',
 'Diancie': 'Rock',
 'Hoopa': 'Psychic',
 'Volcanion': 'Fire'}

In [81]:
df3 = pd.read_csv("data/pokemon.csv", index_col="Pokemon").dropna(how="all").sort_index()

<span style="color:green"><u>Mathematical operation: </u></span>

In [82]:
# Add + 5 to every value in the Serie
# To reflect the change, assign it to df["Completions"]
df["Completions"].add(5).head(1), (df["Completions"] + 5).head(1)

(0    596
 Name: Completions, dtype: int64,
 0    596
 Name: Completions, dtype: int64)

In [83]:
# Take away 5 to every value in the Serie
# To reflect the change, assign it to nba
df["Completions"].sub(5).head(1), (df["Completions"] - 5).head(1)

(0    586
 Name: Completions, dtype: int64,
 0    586
 Name: Completions, dtype: int64)

In [84]:
df["Completions"].mul(5).head(1), df["Completions"].div(5).head(n=1)

(0    2955
 Name: Completions, dtype: int64,
 0    118.2
 Name: Completions, dtype: float64)

<span style="color:green"><u>Group By: </u></span>

In [85]:
# The aggregation is applied on numeric columns
df.groupby('Year').mean().sort_index(ascending=True).head(2)

      Completions
Year
2012   535.078947
2013   526.150000

In [86]:
df.groupby(['Year', 'Sector']).sum().sort_index(ascending=True).head(2)

                                          Completions
Year Sector
2012 Private for-profit, 2-year                  3072
     Private for-profit, 4-year or above          632

In [87]:
df.groupby('Year').describe().transpose()

Year                      2012         2013         2014         2015  \
Completions count    38.000000    40.000000    42.000000    44.000000
            mean    535.078947   526.150000   588.809524   597.250000
            std    1036.433239  1040.474782  1150.355857  1183.371791
            min      13.000000     0.000000     0.000000     0.000000
            25%     114.250000    98.500000   104.500000    87.750000
            50%     229.500000   189.000000   203.500000   191.000000
            75%     420.500000   413.000000   371.750000   405.750000
            max    5388.000000  5278.000000  5093.000000  5335.000000

Year                      2016
Completions count    43.000000
            mean    609.860465
            std    1235.952796
            min       0.000000
            25%      90.000000
            50%     208.000000
            75%     414.000000
            max    5367.000000

In [88]:
sectors = df.groupby("Sector")
sectors

In [89]:
sectors.first()

,University,Year,Sport,Completions
Sector,,,,
"Private for-profit, 2-year",Pima Medical Institute-Las Vegas,2016,Volley,591
"Private for-profit, 4-year or above",University of Phoenix-Nevada,2016,Volley,423
"Private for-profit, less-than 2-year",Healthcare Preparatory Institute,2016,Volley,28
"Private not-for-profit, 2-year",Everest College-Henderson,2016,Volley,233
"Private not-for-profit, 4-year or above",Sierra Nevada College,2016,Volley,261
"Public, 2-year",Truckee Meadows Community College,2016,Volley,2431
"Public, 4-year or above",Western Nevada College,2016,Volley,960

In [90]:
sectors.last()

,University,Year,Sport,Completions
Sector,,,,
"Private for-profit, 2-year",Nevada Career Institute,2012,Volley,101
"Private for-profit, 4-year or above",ITT Technical Institute-Henderson,2012,Volley,263
"Private for-profit, less-than 2-year",Milan Institute-Las Vegas,2012,Volley,325
"Private not-for-profit, 2-year",Expertise Cosmetology Institute,2012,Volley,129
"Private not-for-profit, 4-year or above",Sierra Nevada College,2012,Volley,241
"Public, 2-year",Truckee Meadows Community College,2012,Volley,1170
"Public, 4-year or above",Western Nevada College,2012,Volley,495

In [91]:
sectors.groups

{'Private for-profit, 2-year': [0, 13, 15, 18, 19, 23, 24, 28, 29, 30, 32, 34, 35, 37, 38, 40, 43, 47, 50, 58, 61, 62, 65, 66, 67, 71, 75, 76, 77, 80, 82, 84, 92, 97, 102, 107, 110, 112, 113, 114, 116, 117, 119, 120, 122, 125, 126, 127, 129, 132, 133, 134, 136, 140, 141, 142, 144, 146, 148, 149, 151, 158, 162, 167, 170, 171, 175, 176, 177, 185, 186, 187, 190, 195, 196, 198, 200, 202, 204], 'Private for-profit, 4-year or above': [25, 26, 27, 31, 33, 36, 49, 51, 53, 55, 60, 63, 68, 73, 109, 118, 121, 123, 124, 128, 130, 131, 135, 137, 145, 180, 181, 192, 193], 'Private for-profit, less-than 2-year': ['Index_1', 2, 3, 5, 7, 8, 10, 12, 45, 48, 52, 54, 59, 70, 81, 85, 90, 91, 95, 98, 100, 103, 105, 106, 150, 153, 156, 159, 161, 164, 166, 169, 174, 179, 184, 189, 194, 199], 'Private not-for-profit, 2-year': [41, 42, 83, 86, 88, 93, 138, 165, 191, 205], 'Private not-for-profit, 4-year or above': [16, 17, 20, 22, 44, 69, 79, 87, 111, 115, 139, 143, 147, 172, 183, 201], 'Public, 2-year': [39, 78, 99, 154, 206], 'Public, 4-year or above': [4, 6, 9, 11, 14, 21, 46, 56, 57, 64, 72, 74, 89, 94, 96, 101, 104, 108, 152, 155, 157, 160, 163, 168, 173, 178, 182, 188, 197, 203]}

In [92]:
sectors.sum()
sectors.max()
sectors.min()
sectors.mean()

                                                Year  Completions
Sector
Private for-profit, 2-year               2014.025316   198.075949
Private for-profit, 4-year or above      2014.241379   171.275862
Private for-profit, less-than 2-year     2014.078947   187.289474
Private not-for-profit, 2-year           2014.000000   233.200000
Private not-for-profit, 4-year or above  2014.125000   347.062500
Public, 2-year                           2014.000000  1975.000000
Public, 4-year or above                  2014.000000  2437.333333

In [93]:
# sectors[["Revenue", "Profits"]].sum()
sectors["Year"].sum()

Sector
Private for-profit, 2-year                 159108
Private for-profit, 4-year or above         58413
Private for-profit, less-than 2-year        76535
Private not-for-profit, 2-year              20140
Private not-for-profit, 4-year or above     32226
Public, 2-year                              10070
Public, 4-year or above                     60420
Name: Year, dtype: int64

In [94]:
sectors.agg({"Year": "sum", 
             "Completions": "sum"})

                                           Year  Completions
Sector
Private for-profit, 2-year               159108        15648
Private for-profit, 4-year or above       58413         4967
Private for-profit, less-than 2-year      76535         7117
Private not-for-profit, 2-year            20140         2332
Private not-for-profit, 4-year or above   32226         5553
Public, 2-year                            10070         9875
Public, 4-year or above                   60420        73120

In [95]:
sectors.agg({"Year": "mean", 
             "Completions": ["sum", "mean"]})

                                                Year Completions
                                                mean         sum         mean
Sector
Private for-profit, 2-year               2014.025316       15648   198.075949
Private for-profit, 4-year or above      2014.241379        4967   171.275862
Private for-profit, less-than 2-year     2014.078947        7117   187.289474
Private not-for-profit, 2-year           2014.000000        2332   233.200000
Private not-for-profit, 4-year or above  2014.125000        5553   347.062500
Public, 2-year                           2014.000000        9875  1975.000000
Public, 4-year or above                  2014.000000       73120  2437.333333

In [96]:
years = df.groupby("Year")
df4   = pd.DataFrame(columns= df.columns)
df.columns

Index(['Sector', 'University', 'Year', 'Sport', 'Completions'], dtype='object')

In [97]:
for year, data in years:
    y   = data.nlargest(1, "Completions")
    df4 = df4.append(y)
    
df4.shape, df.shape

((5, 5), (207, 5))

<span style="color:green"><u>Type:</u></span>

In [98]:
df.dtypes

Sector         object
University     object
Year            int64
Sport          object
Completions     int64
dtype: object

In [99]:
df["Year"].dtype

dtype('int64')

In [100]:
df.select_dtypes(['int64']).columns

Index(['Year', 'Completions'], dtype='object')

In [101]:
# Before using astype, make sure that there is no NaN values in the Df
df['Year'] = df['Year'].astype('float')
df['Year'] = df['Year'].astype('bool')
df['Year'] = df['Year'].astype('category')

<span style="color:green"><u>Count:</u></span>

In [102]:
df["Sector"].count()

207

In [103]:
# Counting occurrence of each unique value of a column, without including NaNs
df["Sector"].value_counts()

Private for-profit, 2-year                 79
Private for-profit, less-than 2-year       38
Public, 4-year or above                    30
Private for-profit, 4-year or above        29
Private not-for-profit, 4-year or above    16
Private not-for-profit, 2-year             10
Public, 2-year                              5
Name: Sector, dtype: int64

In [104]:
# Frequence 
df["Sector"].value_counts(ascending=True, normalize=True)

Public, 2-year                             0.024155
Private not-for-profit, 2-year             0.048309
Private not-for-profit, 4-year or above    0.077295
Private for-profit, 4-year or above        0.140097
Public, 4-year or above                    0.144928
Private for-profit, less-than 2-year       0.183575
Private for-profit, 2-year                 0.381643
Name: Sector, dtype: float64

In [105]:
# Unique value
(df['Sector'].nunique(dropna=True), # Doesn't count NaN value
df['Sector'].nunique(dropna=False)) # Count NaN value, it's better than len(df.Gender.unique())

(7, 7)

<span style="color:green"><u>Dummies: </u></span>

**drop_first**: to remove duplicates

Example: A | B | C, If it's neither A nor B, it's necessarily C

In [106]:
sector_dummies = pd.get_dummies(df["Sector"], drop_first=True)
print(f"Before:\n{df.columns}\n")

df = pd.concat([df.drop('Sector', axis=1), sector_dummies], axis=1)
print(f"After:\n{df.columns}")

Before:
Index(['Sector', 'University', 'Year', 'Sport', 'Completions'], dtype='object')

After:
Index(['University', 'Year', 'Sport', 'Completions',
       'Private for-profit, 4-year or above',
       'Private for-profit, less-than 2-year',
       'Private not-for-profit, 2-year',
       'Private not-for-profit, 4-year or above', 'Public, 2-year',
       'Public, 4-year or above'],
      dtype='object')

# Employees dataset

In [107]:
df_employees = pd.read_csv("data/employees.csv").dropna(how="all")
df_employees.head(n=3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance

<span style="color:green"><u>Replace: </u></span>

In [108]:
print(f"Before:\n{df_employees['Team'].value_counts()}\n")

df_employees['Team'].replace(['Sales','toto'], 'OTHER*******', inplace=True)

print(f"After:\n{df_employees['Team'].value_counts()}\n")

Before:
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

After:
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
OTHER*******             94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

<span style="color:green"><u>To datetime:</u></span>

In [109]:
# to_datetime 
# df_employees["Start Date"]      = df_employees.to_datetime(df["Start Date"])
# df_employees["Last Login Time"] = df_employees.to_datetime(df["Last Login Time"])

# Or

df_employees = pd.read_csv("data/employees.csv",
                           parse_dates=["Start Date", "Last Login Time"]).dropna(how="all")

In [110]:
df_employees[df_employees["Start Date"].between("1991-01-01", "1992-01-01")].head(2)
df_employees[df_employees["Last Login Time"].between("08:30AM", "12:00PM")].head(2)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2021-10-08 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2021-10-08 10:43:00,45906,11.598,NaN,Finance

<span style="color:green"><u>String:</u></span>

In [111]:
df_employees['First Name'].str.lower().head(2)

0    douglas
1     thomas
Name: First Name, dtype: object

In [112]:
df_employees['First Name'].str.title().head(2)

0    Douglas
1     Thomas
Name: First Name, dtype: object

In [113]:
# Number of char per string 
df_employees['First Name'].str.len().head(2)

0    7.0
1    6.0
Name: First Name, dtype: float64

In [114]:
df_employees['First Name'].str.replace('Douglas', 'Celia').astype(object).head(2)

0     Celia
1    Thomas
Name: First Name, dtype: object

In [115]:
df_employees['First Name'].str.contains('Thomas').head(2)

0    False
1     True
Name: First Name, dtype: object

In [116]:
df_employees['First Name'].str.startswith('T').head(2)

0    False
1     True
Name: First Name, dtype: object

In [117]:
df_employees['First Name'].str.endswith('s').head(2)

0    True
1    True
Name: First Name, dtype: object

In [118]:
# Remove space 
# lstrip().str.rstrip() <=> strip()
df_employees['First Name'].str.lstrip().str.rstrip().head(2)

0    Douglas
1     Thomas
Name: First Name, dtype: object

In [119]:
df_employees['First Name'].str.split("g", expand=True, n=1).head(2)

        0     1
0     Dou   las
1  Thomas  None

<span style="color:green"><u>Concatenation:</u></span>

In [120]:
# df1 & df2 have the Same Structure
df1 = pd.read_csv("data/Restaurant - Week 1 Sales.csv").dropna(how="all")
df2 = pd.read_csv("data/Restaurant - Week 2 Sales.csv").dropna(how="all")

In [121]:
# When pd concats the 2 df, it will keep the same index, so use ignore_index
pd.concat([df1, df2], ignore_index=True).tail(1)

     Customer ID  Food ID
499          249        6

In [122]:
# pd.concat <=> append
df1.append(df2, ignore_index=True).tail(1)

     Customer ID  Food ID
499          249        6

In [123]:
pd.concat([df1, df2], ignore_index=False).tail(1)

     Customer ID  Food ID
249          249        6

In [124]:
# Which row, comes from which df ??
# <!> Remove ignore_index=True,
pd.concat([df1, df2], keys=["W1", "W2"])

        Customer ID  Food ID
W1 0            537        9
   1             97        4
   2            658        1
   3            202        2
   4            155        9
...             ...      ...
W2 245          783       10
   246          556       10
   247          547        9
   248          252        9
   249          249        6

[500 rows x 2 columns]

<span style="color:green"><u>Merge:</u></span>

`How = ["inner" | "outer" | "left"]`

In [125]:
df1.merge(df2, how="inner", on="Customer ID")
df1.merge(df2, how="inner", on=["Customer ID", "Food ID"])
df1.merge(df2, how="inner", on="Customer ID", suffixes=["-Week1", "-Week2"]).head(3)

   Customer ID  Food ID-Week1  Food ID-Week2
0          537              9              5
1          155              9              3
2          155              1              3

In [126]:
# Outer Join <=> Union ou tout sauf le commun
df1.merge(df2, how="outer", on="Customer ID", indicator=True).head(10)
df1.merge(df2, how="outer", on="Customer ID", indicator=True)["_merge"].value_counts()
df1.merge(df2, how="outer", on="Customer ID", indicator=True).isin(["both"]).head(3)

   Customer ID  Food ID_x  Food ID_y  _merge
0        False      False      False    True
1        False      False      False   False
2        False      False      False   False

In [127]:
df1.merge(df2, how="left", on="Food ID",sort=True).head(2)

   Customer ID_x  Food ID  Customer ID_y
0            658        1            713
1            658        1            473

In [128]:
df1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

<span style="color:green"><u>Save:</u></span>

In [129]:
# Save DF to file.csv

df1.to_csv("saved_file.csv", index=False, columns=["Food ID", "Customer ID"], encoding="utf-8")

<span style="color:green"><u>Read Excel file:</u></span>

In [130]:
# Import and Export File
single_sheet = pd.read_excel("data/Data - Single Worksheet.xlsx")
single_sheet.head(2)

  First Name Last Name    City Gender
0    Brandon     James   Miami      M
1       Sean   Hawkins  Denver      M

In [131]:
# By, default, pd imports the first sheet
# the rest is ignored 
multiple_sheets = pd.read_excel("data/Data - Multiple Worksheets.xlsx")
multiple_sheets.head(2)

  First Name Last Name    City Gender
0    Brandon     James   Miami      M
1       Sean   Hawkins  Denver      M

In [132]:
# sheet_name: Name or Index 

multiple_sheets = pd.read_excel("data/Data - Multiple Worksheets.xlsx", sheet_name=1)
multiple_sheets.head(2)

  First Name Last Name          City Gender
0     Parker     Power       Raleigh      F
1    Preston  Prescott  Philadelphia      F

In [133]:
# Imports all the sheets in a dict 

# Better sheet_name = None 
multiple_sheets = pd.read_excel("data/Data - Multiple Worksheets.xlsx", sheet_name = ["Data 1", "Data 2"])
multiple_sheets["Data 1"]
multiple_sheets["Data 2"]

  First Name Last Name           City Gender
0     Parker     Power        Raleigh      F
1    Preston  Prescott   Philadelphia      F
2    Ronaldo   Donaldo         Bangor      M
3      Megan   Stiller  San Francisco      M
4     Bustin    Jieber         Austin      F

In [134]:
# An Excel export requires an ExcelWriter, which serves as a foundation for the workbook
excel_file = pd.ExcelWriter("Baby Names.xlsx")

f  = single_sheet[single_sheet.Gender == 'F']
m  = single_sheet[single_sheet.Gender == 'M']

f.to_excel(excel_file, sheet_name="f", index = False)
m.to_excel(excel_file, sheet_name="m", index = False)

excel_file.save()

<span style="color:green"><u>Apply:</u></span>

In [135]:
def classify_performance(number: int) -> str:
    return "OK" if number < 10000 else "KO"

In [136]:
df1["Food ID"].apply(lambda x : x / 100).value_counts().nunique()

8

In [137]:
df1["Food ID"].apply(classify_performance)

0      OK
1      OK
2      OK
3      OK
4      OK
       ..
245    OK
246    OK
247    OK
248    OK
249    OK
Name: Food ID, Length: 250, dtype: object

<span style="color:green"><u>Datetime:</u></span>

Pandas Timestamp Object ~ python datetime

In [138]:
birthday = dt.date(1995, 2, 23)
birthday.year, birthday.month, birthday.day

(1995, 2, 23)

In [139]:
dt.datetime(1995, 2, 23, 7, 13, 57), str(dt.datetime(1995, 2, 23, 7, 13, 57))
#.year, .month, .day, .hour, .minute, .second

(datetime.datetime(1995, 2, 23, 7, 13, 57), '1995-02-23 07:13:57')

In [140]:
pd.Timestamp("2015, 11, 11")
pd.Timestamp("2015/11/11 6:13:29 AM")

Timestamp('2015-11-11 06:13:29')

In [141]:
dates =["2015/11/11", "2015/11/12"]
pd.DatetimeIndex(dates), type(pd.DatetimeIndex(dates))

(DatetimeIndex(['2015-11-11', '2015-11-12'], dtype='datetime64[ns]', freq=None),
 pandas.core.indexes.datetimes.DatetimeIndex)

In [142]:
dates    = [dt.date(2015, 11, 11), dt.date(2015, 11, 12)]
dt_index = pd.DatetimeIndex(dates)

dt_index, type(pd.DatetimeIndex(dates))

(DatetimeIndex(['2015-11-11', '2015-11-12'], dtype='datetime64[ns]', freq=None),
 pandas.core.indexes.datetimes.DatetimeIndex)

In [143]:
pd.Series(data=[23, 34], index=dt_index)

2015-11-11    23
2015-11-12    34
dtype: int64

In [144]:
pd.to_datetime("2020-04-19")

Timestamp('2020-04-19 00:00:00')

In [145]:
pd.to_datetime(["2020-04-19", "2020/02/12", "July 4th, 1996"])
pd.to_datetime(dt.date(2015, 1, 1))
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))

Timestamp('2015-01-01 14:35:20')

In [146]:
data = pd.Series(["July 4th, 1996", "2020/02/12", "hello"])
pd.to_datetime(data, errors="coerce")

0   1996-07-04
1   2020-02-12
2          NaT
dtype: datetime64[ns]

In [147]:
pd.to_datetime([12345678, 345666543], unit="s")

DatetimeIndex(['1970-05-23 21:21:18', '1980-12-14 18:29:03'], dtype='datetime64[ns]', freq=None)

In [148]:
# freq = B (business days)
# freq = 3D
# freq = W
# freq = W-FRI
# freq = H, 6H (hour)
# freq = M, 2M (month)
# freq = MS
# freq = A (year)
t = pd.date_range(start="2020-01-03", end="2020-01-31", freq="2D")
t, type(t), type(t[0])

(DatetimeIndex(['2020-01-03', '2020-01-05', '2020-01-07', '2020-01-09',
                '2020-01-11', '2020-01-13', '2020-01-15', '2020-01-17',
                '2020-01-19', '2020-01-21', '2020-01-23', '2020-01-25',
                '2020-01-27', '2020-01-29', '2020-01-31'],
               dtype='datetime64[ns]', freq='2D'),
 pandas.core.indexes.datetimes.DatetimeIndex,
 pandas._libs.tslibs.timestamps.Timestamp)

In [149]:
pd.date_range(start="2020-01-03", periods=5, freq="B")

DatetimeIndex(['2020-01-03', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09'],
              dtype='datetime64[ns]', freq='B')

In [150]:
t = pd.date_range(end="2020-01-31", periods=10, freq="D")
df = pd.Series(t)
df.dt.is_quarter_start

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool